app/controllers/cases_controller.rb

SELECT  "cases".* FROM "cases" WHERE "cases"."id" = $1 LIMIT 1  [["id", 1]]
---
	def show
		@case = Case.find(params[:id])