app/controllers/welcome_controller.rb

	def services
		@cases = Case.all
---
SELECT  "cases".* FROM "cases"  ORDER BY "cases"."id" ASC LIMIT 1