app/controllers/welcome_controller.rb

SELECT "cases".* FROM "cases"  ORDER BY "cases"."name" ASC
---
	def services
		@cases = Case.order(:name)